1c/configuration/InformationRegisters/ЛК_НастройкиСервисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЛК_НастройкиСервисов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УровеньЛогирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛогинПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПарольПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДБазы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1c/configuration/InformationRegisters/ЛК_НастройкиСервисов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция НастройкиСервиса() Экспорт 
	
	СтруктураВозврата = ЛК_РаботаСФункциями.СтруктураВозврата();
	СтруктураРезультата = Новый Структура("АдресСервера, ЛогинПользователя, ПарольПользователя, ИДБазы, УровеньЛогирования");
	
	ВыборкаЗаписей = РегистрыСведений.ЛК_НастройкиСервисов.Выбрать();
	Если ВыборкаЗаписей.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураРезультата, ВыборкаЗаписей);
	Иначе 
		ЛК_РаботаСФункциями.ДобавитьОшибку(СтруктураВозврата, "Не найдены настройки сервиса");
	КонецЕсли;	
	
	ЛК_РаботаСФункциями.ДобавитьРезультат(СтруктураВозврата, СтруктураРезультата);
	
	Возврат СтруктураВозврата;
	
КонецФункции	

#КонецОбласти
